app/views/groups/show.html.erb

        <td>
            <% @group.group_users.each do |gu| %>
---
SELECT "group_users".* FROM "group_users" WHERE "group_users"."group_id" = ?  [["group_id", 7]]