app/views/users/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
            <td>
              <p>コメント数：<%= book.book_comments.count %></p>