app/views/books/_index.html.erb

        <tr id="book_<%= book.id %>">
          <% user = User.find(book.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

          <td class="comments-count">
            <p>コメント数：<%= book.book_comments.count %></p>
---
SELECT "books".* FROM "books" LEFT OUTER JOIN "favorites" ON "favorites"."book_id" = "books"."id" AND "favorites"."created_at" BETWEEN ? AND ? GROUP BY "books"."id" ORDER BY count(book_id) desc  [["created_at", "2021-11-29 00:00:00"], ["created_at", "2021-12-05 23:59:59.999999"]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]