app/views/books/show.html.erb

            <td class="comments-count">
              <p>コメント数：<%= @book.book_comments.count %></p>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]