app/controllers/books_controller.rb

  def index
    @book = Book.new
    @user = current_user
    @books = Book.all
---
SELECT "books".* FROM "books"