app/controllers/books_controller.rb

SELECT "books".* FROM "books" LEFT OUTER JOIN "favorites" ON "favorites"."book_id" = "books"."id" AND "favorites"."created_at" BETWEEN ? AND ? GROUP BY "books"."id" ORDER BY count(book_id) desc  [["created_at", "2021-11-29 00:00:00"], ["created_at", "2021-12-05 23:59:59.999999"]]
---
  def index
    @user = current_user

    #過去１週間のいいねの数が多い順に本の投稿を表示させる
    @books = Book.left_joins(:week_favorites).group(:id).order(Arel.sql('count(book_id) desc'))

INSERT INTO "books" ("title", "body", "user_id", "rate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "あたしんち"], ["body", "面白い"], ["user_id", 2], ["rate", 5.0], ["created_at", "2022-01-02 13:34:24.304724"], ["updated_at", "2022-01-02 13:34:24.304724"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book.id), notice: "successfully"
    else
     #@new = Book.new
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @new = Book.new
    @book = Book.find(params[:id])
    @user = User.find(@book.user_id)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def correct_user
    book = Book.find(params[:id])