app/controllers/group_users_controller.rb

    def create
        group_user = current_user.group_users.new(group_id: params[:group_id])
        group_user.save
---
INSERT INTO "group_users" ("user_id", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["group_id", 7], ["created_at", "2021-12-24 06:45:06.963252"], ["updated_at", "2021-12-24 06:45:06.963252"]]

    def destroy
        group_user = current_user.group_users.find_by(group_id: params[:group_id])
        group_user.destroy
---
SELECT  "group_users".* FROM "group_users" WHERE "group_users"."user_id" = ? AND "group_users"."group_id" = ? LIMIT ?  [["user_id", 4], ["group_id", 5], ["LIMIT", 1]]
DELETE FROM "group_users" WHERE "group_users"."id" = ?  [["id", 1]]