app/controllers/groups_controller.rb

INSERT INTO "groups" ("name", "introduction", "image_id", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sample"], ["introduction", "sample"], ["image_id", nil], ["owner_id", 2], ["created_at", "2021-12-17 02:18:46.593636"], ["updated_at", "2021-12-17 02:18:46.593636"]]
---
    def create
      @group = Group.new(group_params)
      @group.owner_id = current_user.id
      @group.save

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "groups" SET "image_id" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["image_id", "5e55dfd238e26807d2ddc6a3550471483c9ec8a7fc97a325f3880e9ccb59"], ["updated_at", "2021-12-20 08:19:31.197820"], ["id", 5]]
---
    def update
      @group = Group.find(params[:id])
      @group.update(group_params)