app/controllers/users_controller.rb

  def index
    @book = Book.new
    @user = current_user
    @users = User.all
---
SELECT "users".* FROM "users"

  def correct_user
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]